app/controllers/information_controller.rb

SELECT "information".* FROM "information"
---
  def index
    @information = Information.all

INSERT INTO "information" ("First_name", "Last_name", "Phone_number", "Description", "created_at", "updated_at", "user_id", "emails") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    #@information = Information.new(information_params)
    @information = current_user.informations.build(information_params)
    respond_to do |format|
      if @information.save

UPDATE "information" SET "updated_at" = ?, "user_id" = ?, "emails" = ? WHERE "information"."id" = ?  [["updated_at", "2024-07-25 05:58:18.366766"], ["user_id", 3], ["emails", "example@gmail.com1"], ["id", 17]]
---
  def update
    respond_to do |format|
      if @information.update(information_params)

DELETE FROM "information" WHERE "information"."id" = ?  [["id", 17]]
---
  def destroy
    @information.destroy!

SELECT "information".* FROM "information" WHERE "information"."user_id" = ? AND "information"."id" = ? LIMIT ?  [["user_id", 2], ["id", 17], ["LIMIT", 1]]
---
  def correct_user
    @information = current_user.informations.find_by(id: params[:id])

SELECT "information".* FROM "information" WHERE "information"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
    def set_information
      @information = Information.find(params[:id])